# Case 2
# Developers:
# - Simonova Tanya
# - Novikov Dmitriy
# - Churina Margaery

def rect(x, y, side1, side2):
    pass
  # Симон, тут ты пишешь функцию рисования прямоугольника с координатами (правый верхний угол) x, y, и сторонами side1, side2
  
def trian(x, y, side1, side2, side3):
    pass
  # Симон, тут ты пишешь функцию рисования треугольника с координатами (правый верхний угол) x, y, и сторонами side1, side2, side3

def circ(x, y, side1):
    pass
  # Я тут пишу функцию рисования круга с координатами центра x, y, и радиусом side1
  
def square(x, y, side1):
    pass
  # я тут пишу функцию рисования квадрата с координатами (правый верхний угол) x, y, и стороной side1

def rhom(x, y, side1, side2):
    pass
  # Дима, тут ты пишешь функцию рисования ромба с координатами (правый верхний угол) x, y, и сторонами side1, side2
  
def trap(x, y, side1, side2, side3):
    pass
  # Дима, тут ты пишешь функцию рисования трапеции с координатами (правый верхний угол)  x, y, и основаниями side1, side2, боковой стороной - side3
